TestProject/src/Documents/РасходнаНакладная/РасходнаНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаНакладная</name>
  <comment>Документ продажи</comment>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestProject/src/Documents/РасходнаНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	Текданные = ТекущиеДанные();
	Если Текданные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текданные.Сумма = Текданные.Количество * Текданные.Цена;
	ОбновитьОбщуюСуммуПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщуюСуммуПоДокументу()
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	Текданные = ТекущиеДанные();
	Если Текданные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текданные.Сумма = Текданные.Количество * Текданные.Цена;
КонецПроцедуры


&НаКлиенте
Функция ТекущиеДанные()
	Возврат Элементы.СписокНоменклатуры.ТекущиеДанные;
КонецФункции
